* Own slots (Arithmetic-Test):
05 ByteA PIC 99 USAGE BINARY.
05 ByteB PIC 99 USAGE BINARY.
05 ByteC PIC 99 USAGE BINARY.
05 WordA PIC 9999 USAGE BINARY.
05 WordB PIC 9999 USAGE BINARY.
05 WordC PIC 9999 USAGE BINARY.
