000010 IDENTIFICATION DIVISION.
000020 CLASS-ID. MinimalEmpty.
000030 ENVIRONMENT DIVISION.
000040 OBJECT.
000050     DATA DIVISION.
000060         COPY Minimal-Empty-Slots.
000070     PROCEDURE DIVISION.
000080         IDENTIFICATION DIVISION.
000090         METHOD-ID. "Noop".
000100         PROCEDURE DIVISION.
000110             GOBACK.
000120         END METHOD "Noop".
000130 END OBJECT.
000140 END CLASS MinimalEmpty.
