 IDENTIFICATION DIVISION.

000010* CLASS-ID. MinimalExpanded.

000020* ENVIRONMENT DIVISION.

000030* OBJECT.

000040*     DATA DIVISION.

000050*         COPY Minimal-Expanded-Slots.

000060*     PROCEDURE DIVISION.

000070*         IDENTIFICATION DIVISION.

000080*         METHOD-ID. "Test".

000090*         PROCEDURE DIVISION.

000100*             SET X TO 1.

000110*             COMPUTE Y = 2.

000120*             PERFORM Loop.

000130*             CALL Helper.

000140*             GOBACK.

000150* Loop.

000160*             GOBACK.

000170*         END METHOD "Test".

000180* END OBJECT.

000190* END CLASS MinimalExpanded.

000200*
