001000 IDENTIFICATION DIVISION.
001100 CLASS-ID. MinimalExpanded.
001200 ENVIRONMENT DIVISION.
001300 OBJECT.
001400     DATA DIVISION.
001500         COPY Minimal-Expanded-Slots.
001600     PROCEDURE DIVISION.
001700         IDENTIFICATION DIVISION.
001800         METHOD-ID. "Test".
001900         PROCEDURE DIVISION.
002000             SET X TO 1.
002100             COMPUTE Y = 2.
002200             PERFORM Loop.
002300             CALL Helper.
002400             GOBACK.
002500 Loop.
002600             GOBACK.
002700         END METHOD "Test".
002800 END OBJECT.
002900 END CLASS MinimalExpanded.
999999
