000010 IDENTIFICATION DIVISION.
000020 CLASS-ID. MinimalExpanded.
000030 ENVIRONMENT DIVISION.
000040 OBJECT.
000050     DATA DIVISION.
000060         COPY Minimal-Expanded-Slots.
000070     PROCEDURE DIVISION.
000080         IDENTIFICATION DIVISION.
000090         METHOD-ID. "Test".
000100         PROCEDURE DIVISION.
000110             SET X TO 1.
000120             COMPUTE Y = 2.
000130             PERFORM Loop.
000140             CALL Helper.
000150             GOBACK.
000160 Loop.
000170             GOBACK.
000180         END METHOD "Test".
000190 END OBJECT.
000200 END CLASS MinimalExpanded.
