000010 IDENTIFICATION DIVISION.
000020 CLASS-ID. MinimalWithData.
000030 ENVIRONMENT DIVISION.
000040 OBJECT.
000050     DATA DIVISION.
000060         COPY Minimal-With-Data-Slots.
000070     PROCEDURE DIVISION.
000080         IDENTIFICATION DIVISION.
000090         METHOD-ID. "Increment".
000100         PROCEDURE DIVISION.
000110             ADD 1 TO Counter.
000120             GOBACK.
000130         END METHOD "Increment".
000140 END OBJECT.
000150 END CLASS MinimalWithData.
