001000 IDENTIFICATION DIVISION.
001100 CLASS-ID. MinimalCharacter.
001200 ENVIRONMENT DIVISION.
001300 OBJECT.
001400     DATA DIVISION.
001500         COPY Minimal-Character-Slots.
001600     PROCEDURE DIVISION.
001700         IDENTIFICATION DIVISION.
001800         METHOD-ID. "Think".
001900         PROCEDURE DIVISION.
002000             IF HP IS EQUAL TO 0 THEN
002100                 INVOKE Self "Kill".
002200             END-IF.
002300             GOBACK.
002400         END METHOD "Think".
002500         IDENTIFICATION DIVISION.
002600         METHOD-ID. "Kill".
002700         PROCEDURE DIVISION.
002800             GOBACK.
002900         END METHOD "Kill".
003000 END OBJECT.
003100 END CLASS MinimalCharacter.
999999
