 IDENTIFICATION DIVISION.

000010* CLASS-ID. MinimalCharacter.

000020* ENVIRONMENT DIVISION.

000030* OBJECT.

000040*     DATA DIVISION.

000050*         COPY Minimal-Character-Slots.

000060*     PROCEDURE DIVISION.

000070*         IDENTIFICATION DIVISION.

000080*         METHOD-ID. "Think".

000090*         PROCEDURE DIVISION.

000100*             IF HP IS EQUAL TO 0 THEN

000110*                 INVOKE Self "Kill".

000120*             END-IF.

000130*             GOBACK.

000140*         END METHOD "Think".

000150*         IDENTIFICATION DIVISION.

000160*         METHOD-ID. "Kill".

000170*         PROCEDURE DIVISION.

000180*             GOBACK.

000190*         END METHOD "Kill".

000200* END OBJECT.

000210* END CLASS MinimalCharacter.

000220*
