 IDENTIFICATION DIVISION.

000010* CLASS-ID. MinimalEmpty.

000020* ENVIRONMENT DIVISION.

000030* OBJECT.

000040*     DATA DIVISION.

000050*         COPY Minimal-Empty-Slots.

000060*     PROCEDURE DIVISION.

000070*         IDENTIFICATION DIVISION.

000080*         METHOD-ID. "Noop".

000090*         PROCEDURE DIVISION.

000100*             GOBACK.

000110*         END METHOD "Noop".

000120* END OBJECT.

000130* END CLASS MinimalEmpty.

000140*
