 IDENTIFICATION DIVISION.

000010* CLASS-ID. MinimalWithData.

000020* ENVIRONMENT DIVISION.

000030* OBJECT.

000040*     DATA DIVISION.

000050*         COPY Minimal-With-Data-Slots.

000060*     PROCEDURE DIVISION.

000070*         IDENTIFICATION DIVISION.

000080*         METHOD-ID. "Increment".

000090*         PROCEDURE DIVISION.

000100*             ADD 1 TO Counter.

000110*             GOBACK.

000120*         END METHOD "Increment".

000130* END OBJECT.

000140* END CLASS MinimalWithData.

000150*
