001000 IDENTIFICATION DIVISION.
001100 CLASS-ID. MinimalWithData.
001200 ENVIRONMENT DIVISION.
001300 OBJECT.
001400     DATA DIVISION.
001500         COPY Minimal-With-Data-Slots.
001600     PROCEDURE DIVISION.
001700         IDENTIFICATION DIVISION.
001800         METHOD-ID. "Increment".
001900         PROCEDURE DIVISION.
002000             ADD 1 TO Counter.
002100             GOBACK.
002200         END METHOD "Increment".
002300 END OBJECT.
002400 END CLASS MinimalWithData.
999999
