000010 IDENTIFICATION DIVISION.
000020 CLASS-ID. MinimalCharacter.
000030 ENVIRONMENT DIVISION.
000040 OBJECT.
000050     DATA DIVISION.
000060         COPY Minimal-Character-Slots.
000070     PROCEDURE DIVISION.
000080         IDENTIFICATION DIVISION.
000090         METHOD-ID. "Think".
000100         PROCEDURE DIVISION.
000110             IF HP IS EQUAL TO 0 THEN
000120                 INVOKE Self "Kill".
000130             END-IF.
000140             GOBACK.
000150         END METHOD "Think".
000160         IDENTIFICATION DIVISION.
000170         METHOD-ID. "Kill".
000180         PROCEDURE DIVISION.
000190             GOBACK.
000200         END METHOD "Kill".
000210 END OBJECT.
000220 END CLASS MinimalCharacter.
