001000 IDENTIFICATION DIVISION.
001100 CLASS-ID. MinimalEmpty.
001200 ENVIRONMENT DIVISION.
001300 OBJECT.
001400     DATA DIVISION.
001500         COPY Minimal-Empty-Slots.
001600     PROCEDURE DIVISION.
001700         IDENTIFICATION DIVISION.
001800         METHOD-ID. "Noop".
001900         PROCEDURE DIVISION.
002000             GOBACK.
002100         END METHOD "Noop".
002200 END OBJECT.
002300 END CLASS MinimalEmpty.
999999
